In [2871]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder

df = pd.read_csv('csv/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2867]:
dfw = df.drop(columns=['Name','SibSp','Parch','Cabin','Embarked','Ticket','PassengerId'])
dfw.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [2877]:
target = dfw.Survived
inputs = dfw.drop(columns='Survived')

le = LabelEncoder()
inputs['Sex'] = le.fit_transform(inputs['Sex'])

inputs.Age = inputs.groupby(['Sex','Pclass'])['Age'].transform(lambda group_data: group_data.fillna(group_data.median()))
inputs

     Pclass  Sex   Age     Fare
0         3    1  22.0   7.2500
1         1    0  38.0  71.2833
2         3    0  26.0   7.9250
3         1    0  35.0  53.1000
4         3    1  35.0   8.0500
..      ...  ...   ...      ...
886       2    1  27.0  13.0000
887       1    0  19.0  30.0000
888       3    0  21.5  23.4500
889       1    1  26.0  30.0000
890       3    1  32.0   7.7500

[891 rows x 4 columns]

In [2883]:
from sklearn.model_selection import train_test_split as tts
from sklearn.naive_bayes import GaussianNB

X_train, X_test, y_train, y_test = tts(inputs, target, test_size=0.2)

model = GaussianNB()
model.fit(X_train, y_train)
model.score(X_test, y_test)

0.7877094972067039

In [2933]:
predictions = model.predict(X_test[:10])
y_test_df = y_test.copy()

print(f'Predictions: {predictions}')

predictions_df = pd.DataFrame(predictions, index=y_test[:10].index,  columns=['Prediction'])
y_test_df = pd.concat([y_test[:10], predictions_df], axis = 1)
y_test_df

Predictions: [0 1 1 1 0 0 0 0 0 1]

    Survived  Prediction
153        0           0
679        1           1
269        1           1
307        1           1
601        0           0
838        1           0
771        0           0
589        0           0
454        0           0
496        1           1